[
{ 
    "date": "15-09-25", 
    "entry": "MY LIFELOG LOOKS SO BAD HOLY (but it'll get better i just need a break)" 
  },
{ 
    "date": "15-09-25", 
    "entry": "i wasnt even gone for an hour and thats because im just so good at Adobe Photoshop 2025 (cracked)" 
  },
{ 
    "date": "15-09-25", 
    "entry": "im leaving my ubuntu workstation to work on designing the next pages DONT FORGET ABOUT ME" 
  },
{ 
    "date": "15-09-25", 
    "entry": "i dream about html+css like peter parker after getting bit by that spider" 
  },
{ 
    "date": "15-09-25", 
    "entry": "its 1pm and i havent updated my microblog today which means im DEEP in thought probably" 
  },
{ 
    "date": "14-09-25", 
    "entry": "just put in an 8 hour coding shift at the hobby factory, should probably think about taking a break. adding buttons and collecting things for my treasure box is what im going to do for the rest of the day" 
  },
{ 
    "date": "14-09-25", 
    "entry": "I CHANGED MY WEBSITE FONT! Ubuntu was the font i used when designing this site originally and i was so married to Ubuntu but now we're fully rocking Rubik!! the change is quite minor but really makes a big difference around here. fun fact, this is one of the most used fonts on the web :D" 
  },
  { 
    "date": "14-09-25", 
    "entry": "hobbies is definitely destined to be an archive. i think the philosophy i like is that anything that goes in the lifelog goes there because it happened TODAY, or like this week or this month or smth, and then gets moved into the relevant hobbies page" 
  },
  { 
    "date": "14-09-25", 
    "entry": "im struggling to decide what goes in the lifelog page and what goes in the hobbies page this morning. habit tracking obviously belongs in lifelog but what about photography?" 
  },
  { 
    "date": "13-09-25", 
    "entry": "ate too much pizza now tummy hurts goodnight" 
  },
  { 
    "date": "13-09-25", 
    "entry": "celebrating my 5 year anniversary tonight with my beloved girlfriend! going out to dinner at our favourite restaurant (one of our first date spots!), might have photos later :o" 
  },
  { 
    "date": "13-09-25", 
    "entry": "*rattles my chains* LET ME POST ON NEOCITIES MORE THAN 10 TIMES A DAY!!!!!!!!!!" 
  },
  { 
    "date": "13-09-25", 
    "entry": "dude my mouse is the best in the world for 5 months and then the scrollwheel stops working! this has happened twice now! i literally have to scroll with my entire hand just to make any progress." 
  },
  { 
    "date": "13-09-25", 
    "entry": "sometimes i just sit at my computer in silence while coding, or working on something. i never do this on purpose! it usually happens because i paused my music to watch a video or hear something more clearly, and just totally neglect to unpause it after. i just wrote the entire hobbies page notebook in total silence LMAO" 
  },
  { 
    "date": "13-09-25", 
    "entry": "how do i balance wanting to stick to my original design and wanting so badly to change fonts" 
  },
  { 
    "date": "13-09-25", 
    "entry": "i spent ALL night thinking about my website and browsing through other neocities sites.\n\n i really want to start adding other buttons to my site, but first i need my own button! i have a few ideas, but i have so many ideas for so many features on my site that i feel like ill never actually get it done!" 
  },
  { 
    "date": "12-09-25", 
    "entry": "finishing the layout AND getting my guestbook working in the same day :o making more progress than i thought!" 
  },
  { 
    "date": "12-09-25", 
    "entry": "the hardest part about any microblog is coming up with the first entry. hello!" 
  }
]