[
     {
    "date": "03-10-25", 
    "time": "11:57am",
        "entry": "kinda dreading sorting all these photos for the photo page . . . . . "
      },
   {
    "date": "03-10-25", 
    "time": "11:51am",
        "entry": "all my hobbies just come at me at the same time, its overwhelming. 2 weeks ago all i wanted was to lay down. now i want to produce music while i edit photos and mod my xbox 360 and collect more comic books and"
      },
   {
    "date": "02-10-25", 
    "time": "6:43pm",
        "entry": "im so fucking excited to play garry's mod again!!!!!"
      },
  {
    "date": "29-09-25", 
    "time": "4:38pm",
        "entry": "time passed SO quickly today. shame i wasted the day doing nothing at all. it was very nice out. some chores done that were bothering me, not all though."
      },
  {
    "date": "26-09-25", 
    "time": "2:15pm",
        "entry": "well i COULD have held off until the 1st to release the first microworld BUT.........im so impatient and really quite proud of how it turned out. more to come"
      },
  {
    "date": "23-09-25", 
    "time": "1:16pm",
        "entry": "the design and content are great, but the html.................. not so much. the hockey rink is going to be a lot more challenging than i anticipated, so its a good thing im coming up with more and more features LMAO"
      },
   {
    "date": "23-09-25", 
    "time": "10:37am",
        "entry": "im literally obsessed with my hockey shrine and i havent even created the html file. GREAT SIGN OF SUCCESS!!!!!"
      },
      {
    "date": "23-09-25", 
    "time": "9:30am",
        "entry": "when you catch a flying bug and open your hand to check and the little bastard just flies away. pisses me off."
      },
    {
    "date": "23-09-25", 
    "time": "8:57am",
        "entry": "deezer is cracking down on ripping their music which is so tragic and conflicting to me. the only reason i pay for a double deluxe premium subscription is to rip music :/"
      },
   {
    "date": "22-09-25", 
    "time": "1:30am",
        "entry": "yeah so im still awake"
      },
   {
    "date": "21-09-25", 
    "time": "10:51pm",
        "entry": "been tossing and turning since 7pm, not sure why but falling asleep seems a monumental task right now. perhaps getting this microblog out will help, somehow"
      },
   {
    "date": "21-09-25", 
    "time": "2:09pm",
        "entry": "im vibing with this new court theme but like i still want to do my usual digital nightmare vibe as well. might branch out and try new flavours but i want to make buttons now"
      },
    {
    "date": "20-09-25", 
    "time": "6:38pm",
        "entry": "ugh i logged in to make the court page but am just tinkering with various pages instead. i almost just took all my logos to a blender for more variety"
      },
  {
    "date": "20-09-25", 
    "time": "5:01pm",
        "entry": "omega craving for hesburger just took over so i might dinnerpost for awhile. eating a hesburger with a coca-cola in an estonian mall might just my all time favourite memory"
      },
{
    "date": "20-09-25", 
    "time": "8:23am",
        "entry": "theprophat does not deserve to go to work on the weekened!!!!!!! theprophat deserves work free saturdays!!!!!!!!!! theprohat demands freedom!!!!!!"
      },
  {
    "date": "19-09-25", 
    "time": "3:57pm",
        "entry": "dealing with an annoying problem with my heading randomizer, in that it has suddenly stopped working!! im not too happy with the solution but for now it will do (it is staying like that FOREVER)"
      },
  {
    "date": "19-09-25", 
    "time": "4:18am",
        "entry": "the best part about not reading the comics i brought to work the other day is i dont have to pack new ones today and can use that time to write this instead"
      },
  {
    "date": "17-09-25", 
    "time": "8:25pm",
        "entry": "THE HOBBIES PAGE DONE HOLY that was actually hard work, probably 4-5 hours coding that bitch. if i could code as quickly as i can design i'd be developer #1. Dark Times repeat count: 6"
      },
  {
    "date": "17-09-25", 
    "time": "7:55pm",
        "entry": "if i have an album listed on my homepage i am literally just playing it on loop for hours and hours. i have probably listened to Dark Times 4 or 5 times" 
      },
  {
    "date": "17-09-25", 
    "time": "2:46pm",
        "entry": "dont tell megan but the true reason i wanted to go to the library was the mcdonalds" 
      },
  {
    "date": "17-09-25", 
    "time": "2:26pm",
        "entry": "the amount of old people that rent movies from the library is astounding!" 
      },
  {
    "date": "16-09-25", 
    "time": "6:05pm",
        "entry": "adding timestamps was a mistake because now the rapid fire nature of this blog is made so much more apparent" 
      },
  {
    "date": "16-09-25", 
    "time": "6:03pm",
        "entry": "HOLY MY LIFELOG ACTUALLY LOOKS GOOD NOW i didnt have much faith at first tbh but seeing it now is almost like magic, its EXACTLY how i designed it" 
      },
{
"date": "16-09-25", 
"time": "",
    "entry": "feeling nostalgic at work today, its fun to try and remember things i havent thought about in a while. been thinking a lot about my grandma's house, and spending time on her computer eating snacks" 
  },
{
"date": "16-09-25", 
"time": "",
    "entry": "committed omega level spill of a venti pumpkin spice latte during a rush, i actually feel quite clumsy today. should add a mood tracker to my lifelog (and microblog?)" 
  },
{
"date": "16-09-25", 
"time": "",
    "entry": "i have now spent all 3 of my breaks at work today editing code! i didnt even pretend to being comic books for my last break so im just going to talk to microblog all break" 
  },
{
"date": "16-09-25", 
"time": "",
    "entry": "i hate being at work!!!!!! help me!!!!!" 
  },
{
"date": "16-09-25", 
"time": "",
    "entry": "*reminder* i need to figure out how to embed images into the microblog and lifelog. the lifelog could probably be by entry but the microblog will be a challenge" 
  },
{
"date": "16-09-25", 
"time": "",
    "entry": "they dont call me the most dedicated webmaster for nothing. i fixed my layout AND updated the microblog on my break from work" 
  },
{ 
    "date": "15-09-25", 
    "time": "",
    "entry": "MY LIFELOG LOOKS SO BAD HOLY (but it'll get better i just need a break)" 
  },
{ 
    "date": "15-09-25", 
    "time": "",
    "entry": "i wasnt even gone for an hour and thats because im just so good at Adobe Photoshop 2025 (cracked)" 
  },
{ 
    "date": "15-09-25", 
    "time": "",
    "entry": "im leaving my ubuntu workstation to work on designing the next pages DONT FORGET ABOUT ME" 
  },
{ 
    "date": "15-09-25", 
    "time": "",
    "entry": "i dream about html+css like peter parker after getting bit by that spider" 
  },
{ 
    "date": "15-09-25", 
    "time": "",
    "entry": "its 1pm and i havent updated my microblog today which means im DEEP in thought probably" 
  },
{ 
    "date": "14-09-25",
    "time": "", 
    "entry": "just put in an 8 hour coding shift at the hobby factory, should probably think about taking a break. adding buttons and collecting things for my treasure box is what im going to do for the rest of the day" 
  },
{ 
    "date": "14-09-25", 
    "time": "",
    "entry": "I CHANGED MY WEBSITE FONT! Ubuntu was the font i used when designing this site originally and i was so married to Ubuntu but now we're fully rocking Rubik!! the change is quite minor but really makes a big difference around here. fun fact, this is one of the most used fonts on the web :D" 
  },
  { 
    "date": "14-09-25", 
    "time": "",
    "entry": "hobbies is definitely destined to be an archive. i think the philosophy i like is that anything that goes in the lifelog goes there because it happened TODAY, or like this week or this month or smth, and then gets moved into the relevant hobbies page" 
  },
  { 
    "date": "14-09-25", 
    "time": "",
    "entry": "im struggling to decide what goes in the lifelog page and what goes in the hobbies page this morning. habit tracking obviously belongs in lifelog but what about photography?" 
  },
  { 
    "date": "13-09-25", 
    "time": "",
    "entry": "ate too much pizza now tummy hurts goodnight" 
  },
  { 
    "date": "13-09-25", 
    "time": "",
    "entry": "celebrating my 5 year anniversary tonight with my beloved girlfriend! going out to dinner at our favourite restaurant (one of our first date spots!), might have photos later :o" 
  },
  { 
    "date": "13-09-25", 
    "time": "",
    "entry": "*rattles my chains* LET ME POST ON NEOCITIES MORE THAN 10 TIMES A DAY!!!!!!!!!!" 
  },
  { 
    "date": "13-09-25", 
    "time": "",
    "entry": "dude my mouse is the best in the world for 5 months and then the scrollwheel stops working! this has happened twice now! i literally have to scroll with my entire hand just to make any progress." 
  },
  { 
    "date": "13-09-25", 
    "time": "",
    "entry": "sometimes i just sit at my computer in silence while coding, or working on something. i never do this on purpose! it usually happens because i paused my music to watch a video or hear something more clearly, and just totally neglect to unpause it after. i just wrote the entire hobbies page notebook in total silence LMAO" 
  },
  { 
    "date": "13-09-25", 
    "time": "",
    "entry": "how do i balance wanting to stick to my original design and wanting so badly to change fonts" 
  },
  { 
    "date": "13-09-25", 
    "time": "",
    "entry": "i spent ALL night thinking about my website and browsing through other neocities sites.\n\n i really want to start adding other buttons to my site, but first i need my own button! i have a few ideas, but i have so many ideas for so many features on my site that i feel like ill never actually get it done!" 
  },
  { 
    "date": "12-09-25", 
    "time": "",
    "entry": "finishing the layout AND getting my guestbook working in the same day :o making more progress than i thought!" 
  },
  { 
    "date": "12-09-25", 
    "time": "",
    "entry": "the hardest part about any microblog is coming up with the first entry. hello!" 
  }
]